Rails-Server/app/controllers/api/v1/games_controller.rb

      def index

        respond_with Game.all
---
SELECT "games".* FROM "games"

      def create

        respond_with Game.create(params[:game])
---
INSERT INTO "games" ("created_at", "name", "updated_at") VALUES (?, ?, ?)  [["created_at", Sun, 23 Feb 2014 10:23:23 UTC +00:00], ["name", nil], ["updated_at", Sun, 23 Feb 2014 10:23:23 UTC +00:00]]