Rails-Server/app/controllers/api/v1/products_controller.rb

SELECT "products".* FROM "products"
---
      def index

        respond_with Product.all

INSERT INTO "products" ("category_id", "created_at", "name", "price", "released_on", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["category_id", nil], ["created_at", Sun, 23 Feb 2014 04:00:42 UTC +00:00], ["name", nil], ["price", nil], ["released_on", nil], ["updated_at", Sun, 23 Feb 2014 04:00:42 UTC +00:00]]
---
      def create

        respond_with Product.create(params[:product])