Rails-Server/app/controllers/api/v1/users_controller.rb

      def index

        respond_with User.all
---
SELECT "users".* FROM "users"

      def create

        respond_with User.create(params[:user])
---
INSERT INTO "users" ("created_at", "game_id", "name", "updated_at") VALUES (?, ?, ?, ?)  [["created_at", Sun, 23 Feb 2014 10:43:48 UTC +00:00], ["game_id", nil], ["name", "MAXIMUS"], ["updated_at", Sun, 23 Feb 2014 10:43:48 UTC +00:00]]

      def update
        logger.info "\n USER BUG CATCHER\n"
        logger.info params.inspect
        logger.info "\n USER BUG CATCHER\n"
        @user = User.find(params[:id])
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", "15"]]