Rails-Server/app/controllers/products_controller.rb

  def create
    logger.info "\n BUG CATCHER\n"
    logger.info params.inspect
    logger.info "\n BUG CATCHER\n"
    @product = Product.new(params[:product])
    if @product.save
---
INSERT INTO "products" ("category_id", "created_at", "name", "price", "released_on", "updated_at") VALUES (?, ?, ?, ?, ?, ?)